---
type: SpatialElementBoundarySubface
namespace: Autodesk.Revit.DB
version: 2024
members: 9
tags: [revit-api, class]
---

# SpatialElementBoundarySubface

`Autodesk.Revit.DB.SpatialElementBoundarySubface` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetBoundingElementFace | 2012 | `public Face GetBoundingElementFace ()` |
| Method | GetSpatialElementFace | 2012 | `public Face GetSpatialElementFace ()` |
| Method | GetSubface | 2012 | `public Face GetSubface ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | SpatialBoundaryElement | 2012 | `public LinkElementId SpatialBoundaryElement { get ; }` |
| Property | SubfaceArisesFromElementFace | 2012 | `public bool SubfaceArisesFromElementFace { get ; }` |
| Property | SubfaceType | 2012 | `public SubfaceType SubfaceType { get ; }` |
| Property | Valid | 2012 | `public bool Valid { get ; }` |